# Livelier Libraries

#### Table of contents 
### A. Data Collection
#### 1. Acquire some lists of libraries in the UK 
#### 2. Acquire some users' comments for the libraries 
#### 3. Acquire the data of users

### B. Data Understanding
#### 1. 
#### 2. 
#### 3.

In [1]:
# Import relevant libraries
import requests 
import pandas as pd 
import numpy as np 

!conda install -c conda-forge geopy --yes 
from geopy.geocoders import Nominatim 

from IPython.display import Image 
from IPython.core.display import HTML 
    
from pandas.io.json import json_normalize

!conda install -c conda-forge folium=0.5.0 --yes
import folium

Collecting package metadata: done
Solving environment: done

## Package Plan ##

  environment location: /home/jupyterlab/conda

  added / updated specs:
    - geopy


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.6.4                |           py36_0         877 KB  conda-forge
    geographiclib-1.49         |             py_0          32 KB  conda-forge
    geopy-1.18.1               |             py_0          51 KB  conda-forge
    ------------------------------------------------------------
                                           Total:         961 KB

The following NEW packages will be INSTALLED:

  geographiclib      conda-forge/noarch::geographiclib-1.49-py_0

The following packages will be UPDATED:

  conda                                        4.6.3-py36_0 --> 4.6.4-py36_0
  geopy              conda-forge/linux-64::geopy-1.11.0-py~ --> conda-forge/noarch::geopy-1.18.1-py_0



Downloading and Extracting Packages
geopy-1.18.1         | 51 KB     | ##################################### | 100%
conda-4.6.4          | 877 KB    | ##################################### | 100%
geographiclib-1.49   | 32 KB     | ##################################### | 100%
Preparing transaction: done
Verifying transaction: done
Executing transaction: done
Collecting package metadata: done
Solving environment: done

# All requested packages already installed.

In [9]:
# Define my Foursquare API credentials
CLIENT_ID = ''
CLIENT_SECRET = ''
VERSION = '20180605'
print(CLIENT_ID)

H5U3C5TGF5I4OM0C2WBGW0FCWIIODSZMJXIPONYVUJYISWGL

### A. Data Collection
#### 1. Acquires some lists of libraries in the UK

##### Set my starting point at London and get the geographic coordinates

In [22]:
geolocator = Nominatim(user_agent="london")
location = geolocator.geocode("Holborn station, London")
print((location.latitude, location.longitude))

(51.5176863, -0.1185622)

##### Foursquare API query to look up venues in the Library category

In [23]:
LIMIT = 100 
radius = 5000
categoryId ='4bf58dd8d48988d12f941735' #Foursquare Category ID for Libraries

url = 'https://api.foursquare.com/v2/venues/search?categoryId={}&client_id={}&client_secret={}&v={}&ll={},{}&radius={}&limit={}'.format(
    categoryId,
    CLIENT_ID, 
    CLIENT_SECRET, 
    VERSION, 
    location.latitude, 
    location.longitude, 
    radius, 
    LIMIT)
url

'https://api.foursquare.com/v2/venues/search?categoryId=4bf58dd8d48988d12f941735&client_id=H5U3C5TGF5I4OM0C2WBGW0FCWIIODSZMJXIPONYVUJYISWGL&client_secret=GLHA2ZYV5CLZJJ4ZNWI04FLHT1YVJYMZ53NKQJNL35IOC112&v=20180605&ll=51.5176863,-0.1185622&radius=5000&limit=100'

In [24]:
results = requests.get(url).json()

##### Transform the relevant part of the result into a dataframe

In [25]:
venues = results['response']['venues']

libraries_lnd = json_normalize(venues)

#Clean the dataframe
lnd=libraries_lnd[['name','location.lat','location.lng','id']]
lnd.head()

,name,location.lat,location.lng,id
0,City Law School Library,51.519018,-0.114430,4ceea4c0f368b1f761c481f7
1,Barbican Children's Library,51.519502,-0.093278,4c57f4ae744a0f47690bcacb
2,Barbican Public Library,51.519472,-0.094002,4ad2f6dff964a520e7e220e3
3,Crowndale Centre,51.534266,-0.137782,4bb1cfd7f964a52044a43ce3
4,Central Library,51.549100,-0.107011,4d7e2c472ff9b60cca49a747

In [26]:
LND=lnd.copy()
LND['City']='London'
LND.head()

,name,location.lat,location.lng,id,City
0,City Law School Library,51.519018,-0.114430,4ceea4c0f368b1f761c481f7,London
1,Barbican Children's Library,51.519502,-0.093278,4c57f4ae744a0f47690bcacb,London
2,Barbican Public Library,51.519472,-0.094002,4ad2f6dff964a520e7e220e3,London
3,Crowndale Centre,51.534266,-0.137782,4bb1cfd7f964a52044a43ce3,London
4,Central Library,51.549100,-0.107011,4d7e2c472ff9b60cca49a747,London

##### Define a function to get a Library list, when inputs a landmark in a city

In [27]:
def getLibrary (Landmark, City):
    
    geolocator = Nominatim(user_agent="place")
    location = geolocator.geocode(Landmark, City)
    location.latitude, location.longitude
    
    LIMIT = 100 
    radius = 5000
    categoryId ='4bf58dd8d48988d12f941735'
    
    url = 'https://api.foursquare.com/v2/venues/search?categoryId={}&client_id={}&client_secret={}&v={}&ll={},{}&radius={}&limit={}'.format(
        categoryId,
        CLIENT_ID, 
        CLIENT_SECRET, 
        VERSION, 
        location.latitude, 
        location.longitude,
        radius,
        LIMIT)
    
    results = requests.get(url).json()
    venues = results['response']['venues']
    libraries = json_normalize(venues)
    libraries=libraries[['name','location.lat','location.lng','id']]
    
    return(libraries)

##### Get the list of libraries for the 5 other major cities in UK

In [28]:
manchester=getLibrary(Landmark="Manchester town hall", City="Manchester")
manchester.shape

(27, 4)

In [29]:
manchester['City']='Manchester'
manchester.head()

,name,location.lat,location.lng,id,City
0,Central Library,53.477962,-2.244217,4fa7da80e4b0e4baa45f4ddf,Manchester
1,The John Rylands Library,53.480200,-2.249219,4ade0e02f964a5204d6e21e3,Manchester
2,Town Hall Temporary Library,53.479395,-2.248198,525bfa9d11d205d46d9ba5e6,Manchester
3,Greater Manchester Police (Headquarters),53.507300,-2.201200,4f290d22e4b062eef10cb11d,Manchester
4,Newton heath library,53.494269,-2.216384,4c9ce5690e9bb1f73916d85f,Manchester

In [30]:
birmingham=getLibrary(Landmark="St. Philip's Cathedral", City="Birmingham, UK")
birmingham['City']='Birmingham'
birmingham.head()

,name,location.lat,location.lng,id,City
0,The Birmingham & Midland Institute,52.481258,-1.903736,4b058831f964a520fbb722e3,Birmingham
1,Main Library,52.451380,-1.931534,4bdc0dcd63c5c9b655482a68,Birmingham
2,Shakespeare Memorial Room - Library of Birmingham,52.479681,-1.908356,54bd1388498ee7158a19ac45,Birmingham
3,Kings Heath Library,52.437765,-1.892867,4b826089f964a520e9d030e3,Birmingham
4,The Library of Birmingham,52.479623,-1.908404,4c44123adcd61b8d27d47a56,Birmingham

In [31]:
leeds=getLibrary(Landmark="Leeds Station", City="Leeds")
leeds['City']='Leeds'
leeds.shape

(31, 5)

In [32]:
glasgow=getLibrary(Landmark="Glasgow Central Station", City="Glasgow")
glasgow['City']='Glasgow'
glasgow.shape

(31, 5)

In [33]:
liverpool=getLibrary(Landmark="Liverpool Central station", City="liverpool")
liverpool['City']='Liverpool'
liverpool.shape

(24, 5)

In [34]:
#Combines the library dataframes
uk_libraries=pd.concat([LND,manchester,birmingham,leeds,glasgow,liverpool], ignore_index=True)
print(uk_libraries.shape)
uk_libraries.tail()

(182, 5)

,name,location.lat,location.lng,id,City
177,Fade Evidence Knowledge Centre,53.404235,-2.923725,4d93158d7b5ea1436d51bfb8,Liverpool
178,Birkenhead Library,53.385916,-3.031980,4c2b2145ae6820a138471743,Liverpool
179,Allerton Library,53.383724,-2.906881,4c418daee26920a1fd9e5ee7,Liverpool
180,Rock Ferry Library,53.375081,-3.014713,4be26d80660ec928ec89c93b,Liverpool
181,Childwall Library,53.397831,-2.897607,515455c7e4b00958a04fc70b,Liverpool

In [35]:
uk_libraries.columns = ['Library_name', 'Latitude','Longitude','Library_ID','City']
uk_libraries = uk_libraries[['Library_ID','Library_name', 'Latitude','Longitude','City']]

uk_libraries.head()

,Library_ID,Library_name,Latitude,Longitude,City
0,4ceea4c0f368b1f761c481f7,City Law School Library,51.519018,-0.114430,London
1,4c57f4ae744a0f47690bcacb,Barbican Children's Library,51.519502,-0.093278,London
2,4ad2f6dff964a520e7e220e3,Barbican Public Library,51.519472,-0.094002,London
3,4bb1cfd7f964a52044a43ce3,Crowndale Centre,51.534266,-0.137782,London
4,4d7e2c472ff9b60cca49a747,Central Library,51.549100,-0.107011,London

In [36]:
uk_libraries.to_csv("uk_libraries.csv", sep=',', index=False)

In [5]:
uk_libraries=pd.read_csv('uk_libraries.csv')

In [6]:
uk_libraries.head()

,Library_ID,Library_name,Latitude,Longitude,City
0,4ceea4c0f368b1f761c481f7,City Law School Library,51.519018,-0.114430,London
1,4c57f4ae744a0f47690bcacb,Barbican Children's Library,51.519502,-0.093278,London
2,4bb1cfd7f964a52044a43ce3,Crowndale Centre,51.534266,-0.137782,London
3,4b76e42cf964a520ba672ee3,LSE Library,51.514587,-0.115912,London
4,4ad2f6dff964a520e7e220e3,Barbican Public Library,51.519472,-0.094002,London

#### 2. Acquire the users' comments for the Libraries

##### Creates empty dataframe to fill with comments later

In [37]:
column_names = ['Library_ID', 'Comment', 'Likes', 'Dislikes', 'User_ID'] 

library_reviews = pd.DataFrame(columns=column_names)
library_reviews

Empty DataFrame
Columns: [Library_ID, Comment, Likes, Dislikes, User_ID]
Index: []

##### Loop the comments into the dataframe

In [38]:
for index, row in uk_libraries.iterrows():
    row['Library_ID']
    
    url = 'https://api.foursquare.com/v2/venues/{}/tips?client_id={}&client_secret={}&v={}&limit=1'.format(
        row['Library_ID'], CLIENT_ID, CLIENT_SECRET, VERSION)
    reviews = requests.get(url).json()['response']['tips']['items']
    
    for data in reviews:
        ID=row['Library_ID']
        comment=data['text']
        likes=data['agreeCount']
        dislikes=data['disagreeCount']
        user_id=data['user']['id']
        
        library_reviews=library_reviews.append({'Library_ID':ID,
                                               'Comment':comment,
                                               'Likes':likes,
                                               'Dislikes':dislikes,
                                               'User_ID':user_id}, ignore_index=True)

In [35]:
reviews

[{'id': '4dc1725dbe4db3ba385a8531',
  'createdAt': 1304523357,
  'text': 'Want some training in information handling e.g. literature searching, critical appraisal, referencing, reference management software click on more info to send us an email.',
  'type': 'user',
  'url': 'http://mailto:library.services@fade.nhs.uk',
  'canonicalUrl': 'https://foursquare.com/item/4dc1725dbe4db3ba385a8531',
  'lang': 'en',
  'likes': {'count': 0, 'groups': []},
  'logView': True,
  'agreeCount': 0,
  'disagreeCount': 0,
  'todo': {'count': 0},
  'user': {'id': '514079',
   'firstName': 'Kieran',
   'lastName': 'Lamb',
   'gender': 'male',
   'photo': {'prefix': 'https://fastly.4sqi.net/img/user/',
    'suffix': '/VZV33VQ1SQC0HFJY.jpg'}},
  'authorInteractionType': 'liked'}]

In [39]:
library_reviews.head()

,Library_ID,Comment,Likes,Dislikes,User_ID
0,4ad2f6dff964a520e7e220e3,Well utilized space. Especially liked the musi...,0,0,38979216
1,4d7e2c472ff9b60cca49a747,my local library,1,0,1387931
2,547775a2498e5c0b57395932,"A great, quiet space to sit and read the Wellc...",0,0,1940876
3,4b76e42cf964a520ba672ee3,Have spent so much time during the last months...,0,0,203974660
4,4ac518cef964a52019a620e3,"Free admission. See the Magna Carta, original ...",11,0,1352733

In [40]:
print(library_reviews.shape)

(64, 5)

##### Merge 2 dataframes: Library reviews and Libraries

In [41]:
x=pd.merge(library_reviews, uk_libraries, left_on = 'Library_ID', right_on = 'Library_ID', how = 'left')
x.head()

,Library_ID,Comment,Likes,Dislikes,User_ID,Library_name,Latitude,Longitude,City
0,4ad2f6dff964a520e7e220e3,Well utilized space. Especially liked the musi...,0,0,38979216,Barbican Public Library,51.519472,-0.094002,London
1,4d7e2c472ff9b60cca49a747,my local library,1,0,1387931,Central Library,51.549100,-0.107011,London
2,547775a2498e5c0b57395932,"A great, quiet space to sit and read the Wellc...",0,0,1940876,Wellcome Collection Reading Room,51.526036,-0.133561,London
3,4b76e42cf964a520ba672ee3,Have spent so much time during the last months...,0,0,203974660,LSE Library,51.514587,-0.115912,London
4,4ac518cef964a52019a620e3,"Free admission. See the Magna Carta, original ...",11,0,1352733,British Library,51.529610,-0.127490,London

In [42]:
library_reviews=x
library_reviews.shape

(64, 9)

In [43]:
library_reviews.to_csv("uk_library_reviews.csv", sep=',', index=False)

#### 3. Acquire the data of users

In [44]:
# Creates an empty dataframe
column_names = ['User_ID','HomeCity','Gender','Bio'] 

users = pd.DataFrame(columns=column_names)
users

Empty DataFrame
Columns: [User_ID, HomeCity, Gender, Bio]
Index: []

In [45]:
users_data=[]
for index, row in library_reviews.iterrows():
    row['User_ID']
    
    url = 'https://api.foursquare.com/v2/users/{}?client_id={}&client_secret={}&v={}'.format(
        row['User_ID'], CLIENT_ID, CLIENT_SECRET, VERSION)
    result = requests.get(url).json()['response']['user']
    
    #As the 'result' comes as a dictionary, convert it to a list of dictionary to be accessible by index for the loop 
    users_data.append(result.copy())
    
    for data in users_data:
        user=data['id']
        gender=data['gender']
        home=data['homeCity']
        bio=data['bio']
        
        users=users.append({'User_ID':user,
                            'HomeCity':home,
                            'Gender':gender,
                            'Bio':bio}, ignore_index=True)

In [46]:
print(users.shape)
users.head()

(2080, 4)

    User_ID     HomeCity  Gender Bio
0  38979216  Seattle, WA  female
1  38979216  Seattle, WA  female
2   1387931   London, UK  female
3  38979216  Seattle, WA  female
4   1387931   London, UK  female

In [47]:
users_cleaned=users.drop_duplicates(subset=['User_ID'])
users_cleaned.reset_index(drop=True, inplace=True)
print(users_cleaned.shape)
users_cleaned.head()

(61, 4)

,User_ID,HomeCity,Gender,Bio
0,38979216,"Seattle, WA",female,
1,1387931,"London, UK",female,
2,1940876,"London, England",male,"""I'd rather walk if it makes my journey quicker."""
3,203974660,,female,
4,1352733,"Lawrence, KS",male,

In [48]:
users_cleaned.to_csv("uk_library_users.csv", sep=',')


### B. Data Understanding
#### 1.